# What are the SQL queries that you will use to get the below data points?

1. calculate how many users are there in each house ?
2. How many users(show name) follow by each user ?
3. Make a list that connect before 2015, after 2016, between 2014-2018, on 2018 with concate name?
4. Who are the users, whose name finish with 'k' ?
5. Tell me the details of the person, who age is maximum ?
6. Catagory of age where (<30=1) (30-40=2) (>40=3).
7. Tell me the details of the users, whose age is highest in each dept?
8. How many users are there, whose age is same?
9. Tell me the time intervel one user connect with another integer?

In [30]:
#Creating Databases in MySQL

import mysql.connector
mydb = mysql.connector.connect(host="localhost",  
              user="****",  password="*********")
print(mydb)
cursor = mydb.cursor()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000023CCCAD3C70>

In [31]:
cursor.execute('SHOW DATABASES')
for database in cursor:
    print(database)

('abc',)
('business',)
('cantilever',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [32]:
# sql_mode=only_full_group_by

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

In [33]:
# -selected database

cursor.execute('use pharm_easy')

In [34]:
#Show tables

sql= "show tables"
cursor.execute(sql)

for database in cursor:
    print(database)

('employees',)
('follows',)
('users',)

In [35]:
#0.1 #Q0  Table_users

sql= "select * from users "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

('1101', 'Debabrata', 'Maiti', 'BRAK')
('1102', 'Anil', 'Sethi', 'BRAK')
('1103', 'Tilak', 'Maiti', 'BRAK')
('1104', 'Krish', 'Bhow', 'BRAK')
('1105', 'Babu', 'Bhow', 'APJAK')
('1106', 'Bablu', 'Bhow', 'APJAK')
('1107', 'Mrinjoy', 'Goy', 'APJAK')
('1108', 'Mourav', 'Mebsarma', 'APJAK')
('1109', 'Marayan', 'Bhow', 'APJAK')
('1110', 'Samares', 'Maji', 'JLN')
('1111', 'Amitosh', 'Das', 'JLN')
('1112', 'Anup', 'Patra', 'JLN')
('1113', 'Mipti', 'Bhow', 'NSCB')
('1114', 'Bratati', 'Samanta', 'NSCB')
('1115', 'Shyama', 'Lal', 'NSCB')
('1116', 'Arisn', 'Ak', 'NSCB')

In [36]:
#0.1 #Q0  Table_follows

sql= "select * from follows "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

('1101', '1102', '2010-04-21 13:35:20')
('1101', '1105', '2014-07-27 12:35:50')
('1101', '1110', '2018-01-27 18:15:20')
('1101', '1115', '2016-07-07 19:45:40')
('1102', '1116', '2018-04-16 20:05:20')
('1102', '1109', '2015-11-19 22:45:20')
('1102', '1106', '2013-03-13 23:42:20')
('1102', '1103', '2011-09-15 13:22:40')

In [37]:
#0.1 #Q0  Table_employees

sql= "select * from employees "
cursor.execute(sql)
myresult= cursor.fetchall()

for x in myresult:
  print(x)

('1401', 'D Maiti', '140000', 'Prof', '42')
('1402', 'Amit Sethi', '100000', 'Prof', '39')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1405', 'Babu', '60000', 'Engineer', '26')
('1406', 'Bablu', '120000', 'Engineer', '56')
('1407', 'Srinjoy', '80000', 'Engineer', '25')
('1408', 'Samu', '80000', 'Engineer', '58')
('1409', 'Narayan', '50000', 'Doct', '68')
('1410', 'Samares', '20000', 'Doct', '35')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1412', 'Anup', '30000', 'Doct', '32')
('1413', 'Tripti', '40000', 'Techer', '35')
('1414', 'Bratati', '37000', 'Techer', '41')
('1415', 'Hedu', '60000', 'Techer', '58')
('1416', 'Moinag', '29000', 'Techer', '29')

In [38]:
#1 #calculate how many users are there in each house .

sql= "select house,count(user_id) as count from users group by house ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('BRAK', 4)
('APJAK', 5)
('JLN', 3)
('NSCB', 4)

In [39]:
#2 #How many users(show name) follow by each user.

sql= "select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.id group by b.id ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1101', 'Debabrata Maiti', 4)
('1102', 'Anil Sethi', 4)

In [40]:
#3 #Make a list that connect before 2015, after 2016, between 2014-2018, on 2018 with concate name.

sql= "select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.id where date<'2015-01-01' group by b.id "
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>'2015-01-01' group by b.user_id ;
# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>'2014-01-01' and date<'2018-12-30' group by b.user_id ;
# select a.user_id, concat(a.fstname,' ',a.lstname) as name,count(b.follow) as follow from users as a inner join follows as b on a.user_id=b.user_id where date>='2018-01-01' and date<='2018-12-30' group by b.user_id ;
#

('1101', 'Debabrata Maiti', 2)
('1102', 'Anil Sethi', 2)

In [41]:
##3.1 #How many users follow by a particular user, who doesnot belong to same house.
"""
sql="select * from (select A.user_id as id,A.fstname as name,A.house,B.user_id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.user_id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x) """

'\nsql="select * from (select A.user_id as id,A.fstname as name,A.house,B.user_id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.user_id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B"\ncursor.execute(sql)\nmyresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.\n\nfor x in myresult:\n  print(x) '

In [42]:
##3.1 #How many users follow by a particular user, who doesnot belong to same house.
"""
sql= "select name,count(name) as count from (select * from (select A.user_id as id,A.fstname as name,A.house,B.id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B) SUB group by name"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)
  
"""

'\nsql= "select name,count(name) as count from (select * from (select A.user_id as id,A.fstname as name,A.house,B.id,B.follow,B.date from users as A inner join follows as B on A.user_id=B.id order by date) as E inner join (select C.user_id as id_B,C.fstname as name_B,C.house as house_B,D.user_id as user_id_B,D.follow as follow_B,D.date as date_B from users as C inner join follows as D on C.user_id=D.follow order by date) as F on E.date=F.date_B where house!=house_B) SUB group by name"\ncursor.execute(sql)\nmyresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.\n\nfor x in myresult:\n  print(x)\n  \n'

In [43]:
#4 #Start ans finish with k

sql= "select user_id, concat(fstname,' ',lstname) as name,house from users where lstname like '%k' ;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1116', 'Arisn Ak', 'NSCB')

In [44]:
#5 #tell me the details of the person, who age is maximum

sql= "select * from employees order by age desc limit 1"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

#;

('1409', 'Narayan', '50000', 'Doct', '68')

In [45]:
#5.1 #tell me the details of the person, who age is maximum

sql= "select * from employees where age= (select max(age) from employees)"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1409', 'Narayan', '50000', 'Doct', '68')

In [46]:
#6 #Catagory of age where (<30=1) (30-40=2) (>40=3)

sql= "select id,name,salary,dept,age, CASE WHEN age<30 THEN 'A' WHEN age BETWEEN 30 AND 45 THEN 'AA' WHEN age>45 THEN 'AAA' END AS category from employees order by category;"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1403', 'Tilak Maiti', '40000', 'Prof', '29', 'A')
('1404', 'Krish Nendu', '70000', 'Prof', '27', 'A')
('1405', 'Babu', '60000', 'Engineer', '26', 'A')
('1407', 'Srinjoy', '80000', 'Engineer', '25', 'A')
('1411', 'Amitosh', '40000', 'Doct', '27', 'A')
('1416', 'Moinag', '29000', 'Techer', '29', 'A')
('1401', 'D Maiti', '140000', 'Prof', '42', 'AA')
('1402', 'Amit Sethi', '100000', 'Prof', '39', 'AA')
('1410', 'Samares', '20000', 'Doct', '35', 'AA')
('1412', 'Anup', '30000', 'Doct', '32', 'AA')
('1413', 'Tripti', '40000', 'Techer', '35', 'AA')
('1414', 'Bratati', '37000', 'Techer', '41', 'AA')
('1406', 'Bablu', '120000', 'Engineer', '56', 'AAA')
('1408', 'Samu', '80000', 'Engineer', '58', 'AAA')
('1409', 'Narayan', '50000', 'Doct', '68', 'AAA')
('1415', 'Hedu', '60000', 'Techer', '58', 'AAA')

In [47]:
#7 #Highest age in each dept (Wrong)

sql= "select * from employees where age= any(select max(age) from employees group by dept)"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1401', 'D Maiti', '140000', 'Prof', '42')
('1408', 'Samu', '80000', 'Engineer', '58')
('1409', 'Narayan', '50000', 'Doct', '68')
('1415', 'Hedu', '60000', 'Techer', '58')

In [48]:
#7.1 #Highest age in each dept using window function

sql= "select * from (select ROW_NUMBER() OVER(PARTITION BY dept order by age desc) as rnk, id,name,salary,dept,age from employees)SUB where rnk<=1"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

(1, '1409', 'Narayan', '50000', 'Doct', '68')
(1, '1408', 'Samu', '80000', 'Engineer', '58')
(1, '1401', 'D Maiti', '140000', 'Prof', '42')
(1, '1415', 'Hedu', '60000', 'Techer', '58')

In [49]:
#8 # How many are copyed/repetative and what are those values.

sql= "select a.id,a.name,a.salary,a.dept,a.age from employees as a inner join (select age, count(age) from employees group by age having count(age)>1) as b on a.age=b.age order by age"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1404', 'Krish Nendu', '70000', 'Prof', '27')
('1411', 'Amitosh', '40000', 'Doct', '27')
('1403', 'Tilak Maiti', '40000', 'Prof', '29')
('1416', 'Moinag', '29000', 'Techer', '29')
('1410', 'Samares', '20000', 'Doct', '35')
('1413', 'Tripti', '40000', 'Techer', '35')
('1408', 'Samu', '80000', 'Engineer', '58')
('1415', 'Hedu', '60000', 'Techer', '58')

In [50]:
# LEAD
#9 #Tell me the time intervel one user connect with another integer-

sql= "select id,follow,date,LastDay,DATEDIFF(LastDay,date) as Diff from (select id,follow,date, LEAD(date,1,'2020-03-04') OVER(PARTITION BY id order by id,date) AS LastDay from follows) SUB"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1101', '1102', '2010-04-21 13:35:20', '2014-07-27 12:35:50', 1558)
('1101', '1105', '2014-07-27 12:35:50', '2016-07-07 19:45:40', 711)
('1101', '1115', '2016-07-07 19:45:40', '2018-01-27 18:15:20', 569)
('1101', '1110', '2018-01-27 18:15:20', '2020-03-04', 767)
('1102', '1103', '2011-09-15 13:22:40', '2013-03-13 23:42:20', 545)
('1102', '1106', '2013-03-13 23:42:20', '2015-11-19 22:45:20', 981)
('1102', '1109', '2015-11-19 22:45:20', '2018-04-16 20:05:20', 879)
('1102', '1116', '2018-04-16 20:05:20', '2020-03-04', 688)

In [51]:
#
#Cumulative age department wise

sql= "select id,name,dept,age, sum(age) over(partition by dept order by age) as cum from employees"
cursor.execute(sql)
myresult= cursor.fetchall()   #fetchall() method, which fetches all rows from the last executed statement.

for x in myresult:
  print(x)

('1411', 'Amitosh', 'Doct', '27', 27.0)
('1412', 'Anup', 'Doct', '32', 59.0)
('1410', 'Samares', 'Doct', '35', 94.0)
('1409', 'Narayan', 'Doct', '68', 162.0)
('1407', 'Srinjoy', 'Engineer', '25', 25.0)
('1405', 'Babu', 'Engineer', '26', 51.0)
('1406', 'Bablu', 'Engineer', '56', 107.0)
('1408', 'Samu', 'Engineer', '58', 165.0)
('1404', 'Krish Nendu', 'Prof', '27', 27.0)
('1403', 'Tilak Maiti', 'Prof', '29', 56.0)
('1402', 'Amit Sethi', 'Prof', '39', 95.0)
('1401', 'D Maiti', 'Prof', '42', 137.0)
('1416', 'Moinag', 'Techer', '29', 29.0)
('1413', 'Tripti', 'Techer', '35', 64.0)
('1414', 'Bratati', 'Techer', '41', 105.0)
('1415', 'Hedu', 'Techer', '58', 163.0)